#LTrim, Off

; --------------------------------------------------------------------
; 全域快速鍵
; --------------------------------------------------------------------
HelpText1 =
(` %
■ 全域快速鍵說明

啟動或切換應用程式、控制視窗位置與大小、控制系統音量、設定鍵盤與滑鼠、
光碟機進片或退片、螢幕保護功能等等。

■ Total Hotkey 功能鍵

Win + H                 Total Hotkey 功能說明
Win + P                 Total Hotkey [停用／啟用]

■ [啟動／切換] 應用程式

Win + A                 小算盤
Win + C                 命令提示字元
Win + I                 Internet Explorer
Win + J                 OneNote
Win + K                 Mozilla Firefox
Win + N                 記事本
Win + O                 Outlook
Win + Q                 小畫家
Win + S                 foobar2000
Win + T                 Total Commander
Win + V                 UltraEdit
Win + W                 Windows Live Mail
Win + X                 EmEditor
Win + Y                 Calendar (複製日期到剪貼簿)
Win + Z                 資源回收筒

■ 鍵盤設定

Win + \                 鍵盤游標加速

■ 滑鼠設定

Win + 滑鼠滾輪          滾輪向上：滑鼠速度增加 (+1)
                        滾輪向下：滑鼠速度減少 (-1)
                        滑鼠中鍵：啟用／停用滑鼠加速
Ctrl + Win + 滑鼠滾輪   滾輪向上：滑鼠速度增加 (+5)
                        滾輪向下：滑鼠速度減少 (-5)
                        滑鼠中鍵：啟用／停用點選鎖定
Win + 滑鼠左鍵          雙擊滑鼠左鍵
Win + 滑鼠右鍵          上一頁 (模擬 Alt + Left)
Win + [                 減少滑鼠速度
Win + ]                 增加滑鼠速度
Win + ,                 滑鼠游標移至螢幕右上方
Win + .                 滑鼠游標移至桌面中央／切換多螢幕
Win + /                 設定滑鼠游標位置
Ctrl + Win + [          啟用／停用滑鼠加速
Ctrl + Win + ]          啟用／停用點選鎖定

■ 視窗控制

Win + Numpad0           視窗大小設為桌面大小並最大化
Win + Numpad1           視窗位置移至桌面左下方
Win + Numpad2           視窗位置移至桌面下方
Win + Numpad3           視窗位置移至桌面右下方
Win + Numpad4           視窗位置移至桌面左方
Win + Numpad5           視窗位置移至桌面中央
Win + Numpad6           視窗位置移至桌面右方
Win + Numpad7           視窗位置移至桌面左上方
Win + Numpad8           視窗位置移至桌面下方
Win + Numpad9           視窗位置移至桌面右下方
Ctrl + Win + Numpad0    視窗大小設為桌面大小
Ctrl + Win + Numpad1    視窗大小設為 320x240
Ctrl + Win + Numpad2    視窗大小設為 640x480
Ctrl + Win + Numpad3    視窗大小設為 800x600
Ctrl + Win + Numpad4    視窗大小設為 1024x768
Ctrl + Win + Numpad5    視窗大小設為 1280x1024
Ctrl + Win + Numpad6    視窗大小設為 1600x1200
Ctrl + Win + Numpad7    視窗比例設為桌面的 1/4
Ctrl + Win + Numpad8    視窗比例設為桌面的 1/2
Ctrl + Win + Numpad9    視窗比例設為桌面的 4/5
Win + Up                視窗 [最大化／還原]
Win + Down              視窗最小化
Ctrl + Win + Left       視窗水平並排
Ctrl + Win + Right      視窗垂直並排
Ctrl + Win + Up         視窗重疊顯示
Ctrl + Win + Down       所有視窗最大化
Win + PageUp            視窗設為最上層顯示
Win + PageDown          視窗取消最上層顯示
Alt + Win + Numpad0     取消視窗透明化
Alt + Win + Numpad1     視窗透明度 10%
Alt + Win + Numpad2     視窗透明度 20%
Alt + Win + Numpad3     視窗透明度 30%
Alt + Win + Numpad4     視窗透明度 40%
Alt + Win + Numpad5     視窗透明度 50%
Alt + Win + Numpad6     視窗透明度 60%
Alt + Win + Numpad7     視窗透明度 70%
Alt + Win + Numpad8     視窗透明度 80%
Alt + Win + Numpad9     視窗透明度 90%

■ 音量控制

Win + NumpadAdd         主音量 +5%
Win + NumpadSub         主音量 -5%
Win + NumpadMult        主音量 [設為靜音／取消靜音]

■ 光碟機控制

Win + NumpadDot         預設光碟機 [退片／進片]
                        如果要設定光碟機的磁碟代號，請見執行參數說明

■ 螢幕保護

Ctrl + PrintScreen      啟動螢幕保護程式
Shift + PrintScreen     設定螢幕保護程式
Win + PrintScreen       關閉螢幕
)

; --------------------------------------------------------------------
; 應用程式快速鍵
; --------------------------------------------------------------------
HelpText2 =
(` %
■ 應用程式快速鍵說明

詳見以下各項應用程式快速鍵說明。

■ Command Prompt (命令提示字元)

Ctrl + K                標記
Ctrl + V                貼上
Ctrl + A                全選
Ctrl + L                捲動
Ctrl + F                尋找

■ Notepad (記事本)

Ctrl + C                複製／複製整行 (未選取文字時)
Ctrl + X                剪下／剪下整行 (未選取文字時)
Ctrl + E                刪除整行
Ctrl + 滑鼠左鍵         雙擊滑鼠左鍵
Ctrl + 滑鼠中鍵         清除剪貼簿
Ctrl + 滑鼠右鍵         貼上／刪除 (選取文字且剪貼簿沒有資料時)

■ SciTE

Ctrl + C                複製／複製整行 (未選取文字時)
Ctrl + X                剪下／剪下整行 (未選取文字時)
Ctrl + E                刪除整行
Ctrl + B                選取括號內文字
Ctrl + Up               上一段落
Ctrl + Down             下一段落
Ctrl + 滑鼠左鍵         雙擊滑鼠左鍵
Ctrl + 滑鼠中鍵         清除剪貼簿
Ctrl + 滑鼠右鍵         貼上／刪除 (選取文字且剪貼簿沒有資料時)

■ Total Commander

Ctrl + 1                複製工作路徑
Ctrl + 2                複製檔案路徑
Ctrl + 3                複製檔案名稱
Ctrl + 4                複製檔案名稱 (包含副檔名)
Ctrl + 5                如果檔案名稱最左邊包含一對括號，複製其中的文字
Ctrl + 6                如果檔案名稱最右邊包含一對括號，複製其中的文字
)

; --------------------------------------------------------------------
; 特殊符號快速鍵
; --------------------------------------------------------------------
HelpText3 =
(` %
■ 特殊符號快速鍵說明

在以下應用程式裡，可以使用快速鍵來輸入特殊符號。

    ‧EmEditor v14.5.4
    ‧Evernote v5.9.1.8742
    ‧MarkdownPad v2.5.0.27920
    ‧Notepad v6.1 (記事本)
    ‧OneNote 2007
    ‧Outlook 2007
    ‧PCMan v8.2.0
    ‧PieTTY v0.3.27
    ‧Rainlendar Lite v2.13.1
    ‧SciTE v3.7.3
    ‧Skype v7.38.0.101
    ‧UltraEdit v22.10.0.12
    ‧Visual Studio 2010
    ‧WinMerge v2.12.4
    ‧Word 2007

■ 特殊符號快速鍵一覽

請按 Alt 及下列按鍵來輸入特殊符號。

    ┌─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─┬─────┐
    │` │1 │2 │3 │4 │5 │6 │7 │8 │9 │0 │- │= │BackSpace │
    │  │┌│┬│┐│〝│〞│‘│’│“│”│『│』│「│          │
    ├─┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬────┤
    │Tab │Q │W │E │R │T │Y │U │I │O │P │[ │] │   \    │
    │    │├│┼│┤│※│〈│〉│《│》│【│】│﹝│﹞│   」   │
    ├──┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴────┤
    │ Caps │A │S │D │F │G │H │J │K │L │; │' │  Enter   │
    │ Lock │└│┴│┘│○│●│↑│↓│！│：│；│、│          │
    ├───┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴┬┴─────┤
    │ Shift  │Z │X │C │V │B │N │M │, │. │/ │   Shift    │
    │        │─│││◎│§ │←│→│。│，│‧│？│            │
    ├──┬─┴┬┴┴┼─┴─┴─┴─┴─┴┬┴─┼─┴┬──┬──┤
    │Ctrl│Win │Alt │       Space        │Alt │Win │Menu│Ctrl│
    │    │    │    │                    │    │    │    │    │
    └──┴──┴──┴──────────┴──┴──┴──┴──┘
)

; --------------------------------------------------------------------
; 快速字串
; --------------------------------------------------------------------
HelpText4 =
(` %
■ 快速字串說明

轉換數值、輸入日期時間、分隔線、程式註解、特殊符號等等。

標示 * 的項目輸出結果與快速字串邊界設定有關，詳見執行參數說明。

■ 轉換數值 (限正整數)

//.                     轉換剪貼簿數字為 [十進制／十六進制]

■ 日期時間

//wday                  日期 (格式為 yyyy-mm-dd 星期○)
//date                  日期 (格式為 yyyy-mm-dd)
//time                  時間 (格式為 24 小時制 hh:mm:ss)
//wl                    日期分隔線 (格式為 yyyy-mm-dd 星期○) *

■ 分隔線

//l1                    「分隔線」分隔線
//l2                    「我是分隔線」分隔線
//l3                    「補充分隔線」分隔線
//l4                    「請沿此線剪下」分隔線
//ll                    「------」分隔線 *
//lt                    剪貼簿文字分隔線 *
//tt                    剪貼簿文字置中 *
//tl                    剪貼簿文字置中分隔線 *

■ 程式註解

//al                    「; ----」分隔線 *
//at                    「; ----」剪貼簿文字分隔線 *
//cl                    「// ---」分隔線 *
//ct                    「// ---」剪貼簿文字分隔線 *
//pl                    「# ----」分隔線 *
//pt                    「# ----」剪貼簿文字分隔線 *

■ 標點符號

;;ph                    ˙　ˊ　ˇ　ˋ
;;[                     「　」　『　』　【　】　《　》　〈　〉
;;]                     ﹁　﹂　﹃　﹄　︵　︶　︽　︾　︿　﹀

■ 數學符號

;;-                     ±　×　÷
;;=                     ≦　≧　≒　≠　≡
;;8                     ∞
;;sqrt                  √
;;itst                  ∩
;;unio                  ∪
;;angl                  ∠
;;delt                  ⊿
;;log                   ㏒
;;ln                    ㏑
;;itgl                  ∫
;;cont                  ∮
;;bcs                   ∵
;;tf                    ∴

■ 度量單位

;;mil                   ㏕
;;mm                    ㎜
;;cm                    ㎝
;;km                    ㎞
;;m2                    ㎡
;;mg                    ㎎
;;kg                    ㎏
;;cc                    ㏄
;;dg                    °　℃　℉

■ 常用符號

;;ar                    ↙　↓　↘　←　↔　→　↖　↑　↗　↕
;;da                    ⇙　⇓　⇘　⇐　⇔　⇒　⇖　⇑　⇗　⇕
;;wa                    ⇦　⇨　⇧　⇩
;;fg                    ☜　☞　☝　☟　☚　☛
;;tab                   ↹
;;ent                   ↲
;;chk                   ✓　✕　☐　☑　☒
;;$                     ￥　€　￡　￠
;;sex                   ♂　♀
;;no                    №
;;post                  〒
;;mail                  ✉
;;tel                   ℡　☎
;;com                   ©　®　™　㊣　㈲　㈱
;;mus                   ♩　♪　♫　♬　♭　♮　♯
;;pok                   ♤　♠　♡　♥　♢　♦　♧　♣
;;scis                  ✂
;;airp                  ✈
;;skul                  ☠
;;sun                   ☼　☀
;;moon                  ☽　☾　☪
;;star                  ☆　★　✩　✪　✡
;;clou                  ☁
;;umbr                  ☂
;;mk                    ◇　◆　□　■　○　●　◎
;;tr                    △　▲　▽　▼　▷　▶　◁　◀　◤　◥　◣　◢
;;bh                    ▁　▂　▃　▄　▅　▆　▇　█
;;bv                    ▏　▎　▍　▌　▋　▊　▉　█

■ 表格符號

;;t0                    ─　═　│　║
;;t1                    └　╰　╚　╘　╙
;;t2                    ┴　╩　╧　╨
;;t3                    ┘　╯　╝　╛　╜
;;t4                    ├　╠　╞　╟
;;t5                    ┼　╬　╪　╫
;;t6                    ┤　╣　╡　╢
;;t7                    ┌　╭　╔　╒　╓
;;t8                    ┬　╦　╤　╥
;;t9                    ┐　╮　╗　╕　╖

■ 數字

;;nw                    ①　②　③　④　⑤　⑥　⑦　⑧　⑨　⑩
                        ⑪　⑫　⑬　⑭　⑮　⑯　⑰　⑱　⑲　⑳　⓪
;;nb                    ➊　➋　➌　➍　➎　➏　➐　➑　➒　➓
;;n.                    ⒈　⒉　⒊　⒋　⒌　⒍　⒎　⒏　⒐　⒑
                        ⒒　⒓　⒔　⒕　⒖　⒗　⒘　⒙　⒚　⒛
;;nc                    ⑴　⑵　⑶　⑷　⑸　⑹　⑺　⑻　⑼　⑽
                        ⑾　⑿　⒀　⒁　⒂　⒃　⒄　⒅　⒆　⒇
;;nh                    ㈠　㈡　㈢　㈣　㈤　㈥　㈦　㈧　㈨　㈩

■ 羅馬數字

;;ru                    Ⅰ　Ⅱ　Ⅲ　Ⅳ　Ⅴ　Ⅵ　Ⅶ　Ⅷ　Ⅸ　Ⅹ
;;rl                    ⅰ　ⅱ　ⅲ　ⅳ　ⅴ　ⅵ　ⅶ　ⅷ　ⅸ　ⅹ

■ 英文字母

;;eu                    Ⓐ　Ⓑ　Ⓒ　Ⓓ　Ⓔ　Ⓕ　Ⓖ　Ⓗ　Ⓘ　Ⓙ　Ⓚ　Ⓛ
                        Ⓜ　Ⓝ　Ⓞ　Ⓟ　Ⓠ　Ⓡ　Ⓢ　Ⓣ　Ⓤ　Ⓥ　Ⓦ　Ⓧ
                        Ⓨ　Ⓩ
;;el                    ⓐ　ⓑ　ⓒ　ⓓ　ⓔ　ⓕ　ⓖ　ⓗ　ⓘ　ⓙ　ⓚ　ⓛ
                        ⓜ　ⓝ　ⓞ　ⓟ　ⓠ　ⓡ　ⓢ　ⓣ　ⓤ　ⓥ　ⓦ　ⓧ
                        ⓨ　ⓩ
;;ec                    ⒜　⒝　⒞　⒟　⒠　⒡　⒢　⒣　⒤　⒥　⒦　⒧
                        ⒨　⒩　⒪　⒫　⒬　⒭　⒮　⒯　⒰　⒱　⒲　⒳
                        ⒴　⒵

■ 希臘字母

;;gu                    Α　Β　Γ　Δ　Ε　Ζ　Η　Θ　Ι　Κ　Λ　Μ
                        Ν　Ξ　Ο　Π　Ρ　Σ　Τ　Υ　Φ　Χ　Ψ　Ω
;;gl                    α　β　γ　δ　ε　ζ　η　θ　ι　κ　λ　μ
                        ν　ξ　ο　π　ρ　σ　τ　υ　φ　χ　ψ　ω
)

; --------------------------------------------------------------------
; 執行參數
; --------------------------------------------------------------------
HelpText5 =
(` %
■ 執行參數說明

/Drive:[C-Z]            設定光碟機控制所使用的磁碟代號
                        如果沒有設定此項參數，則使用系統預設光碟機

/Margin:[Number]        設定快速字串的邊界
                        設定值範圍 30～132，預設值為 70
)

#LTrim, On
