; --------------------------------------------------------------------
; 送出字串
; --------------------------------------------------------------------
SendString(String)
{
    SendRaw, %String%
}

; --------------------------------------------------------------------
; 傳回字串長度 (非 ASCII 字元以 2 計算)
; --------------------------------------------------------------------
StrLenW(String)
{
    StringSplit, Char, String
    Length := 0
    Loop, %Char0%
    {
        ; 若為 ASCII 字元
        If (Asc(Char%A_Index%) < 0x7F)
        {
            Length++
        }
        Else
        {
            Length += 2
        }
    }
    Return, Length
}
